mosfet79/Albanet_Firmware_Destroy/HUB_Provisioner_Firmware/SWD/HUB_FINAL_RELEASE/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_MeshLightingProvisioner/STM32_WPAN/app/appli_mesh.c
//	uint8_t srcElementAddr = BLEMesh_GetAddress();
//	MOBLEUINT16 dataBufLen = 0;
//	MOBLE_ADDRESS dstAddr;
//	MOBLE_ADDRESS data[6];
//
//	data[0] = 0x20;
//	data[1] = 0x20 >> 8;
//	dataBufLen = 2;
//
//	uint8_t Trasfer_Data = 0xA2;
//
//	uint8_t ALBANET_DATA[] = {0xA1, 0xA2, 0xA3, 0xA4, 0xA5, 0xA6};
//
//	/*LINK TO SEND FREQUENTLY TO THE SYSTEM I2c*/
//	Extract_x29();
//
//	  TRACE_I(TF_PROVISION,"ALBANET (appli_mesh.c [1011])Starting Provisioner Mode \r\n");
//
//	  uint8_t albanet_frames[22]= {};
//	  if (HAL_I2C_Mem_Read(&hi2c1, ESP32_ADDR, 0x0000, 1, albanet_frames, sizeof(albanet_frames), 5) != 1){
//		 	BSP_LED_Toggle(LED_RED);
//	  }





  /* Proxy Node, will be called whenever Gatt connection is established */
  /* Turn ON Red LED*/
  ProxyFlag = 1;

  /*Action to Read I2C and store using BUFFER EXCLUSIVE FOR ESP32*/
  /* HAL_I2C_MEM_WRITE(A, B, C, D, E, F, G)
   * A = HandleTypeDef
   * B = Device Address
   * C = Memory Section Address
   * D = Memory Section Size
   * E = Data to Include
   * F = Data to Include Size
   * G = Timeout of Process
   *
   * */

	//if (HAL_I2C_Mem_Write(&hi2c1, ESP32_ADDR, 0x0000, 1, ALBANET_DATA, sizeof(ALBANET_DATA), 5) != 1){
	//  	BSP_LED_Toggle(LED_RED);
	//}

  BSP_LED_On(LED_GREEN);
}

/**
* @brief  Call back function called when GATT Disconnection Complete  
* @param  none
* @retval none
*/ 
void Appli_BleGattDisconnectionCompleteCb(void)
{ 

//	uint8_t srcElementAddr = BLEMesh_GetAddress();
//	MOBLEUINT16 dataBufLen = 0;
//	MOBLE_ADDRESS dstAddr;
//	MOBLE_ADDRESS data[6];
//
//	data[0] = 0x20;
//	data[1] = 0x20 >> 8;
//	dataBufLen = 2;
//
//	uint8_t data_extracted[22] = {};


	ProvisionFlag = 0;
	/* Proxy Node, will be called whenever Gatt disconnected */
	/* Turn Off Red LED*/
	ProxyFlag = 0;

	/*Action to obtain MACADDRESS and compare the element */
  	/*
  	 * This is the process to read and catch from memory the information
  	 *                         HAL_I2C_MEM_READ(A, B, C, D, E)
  	 * A = Handle TypeDef
  	 * B = Device Address
  	 * C = Address for extract data
  	 * D = Length space to locate data
  	 * E = Variable to Store Data
  	 * F = Space Reservation on Memory to Store Data
  	 * G = TimeOut
  	 * */

	//if (HAL_I2C_Mem_Read(&hi2c1, ESP32_ADDR, 0x0000, 1, data_extracted, sizeof(data_extracted), 5) != 1){
	//  	BSP_LED_Toggle(LED_BLUE);
	//}


  BSP_LED_Off(LED_GREEN);
}

/**
* @brief Unprovisioned Node Identification
* @param MOBLEUINT8 data 
* @retval none
*/
void Appli_BleUnprovisionedIdentifyCb(MOBLEUINT8 data)
{
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  PrvngInProcess = 1;  
#endif   
}

/**
* @brief  Set Number of Elements in a Node
* @param  none
* @retval Sending the value to BLE Mesh Library
*/ 
MOBLEUINT8 Appli_BleSetNumberOfElementsCb(void)
{
  if(NumberOfElements > MAX_NUMB_ELEMENTS)
  {
    TRACE_M(TF_MISC,"In version 1.11.00x one Element per node is supported!\r\n"); 
    return MAX_NUMB_ELEMENTS;
  }
  
  else if(NumberOfElements == 0)
  {
    TRACE_M(TF_MISC,"Number Of Elements must be 1 or greater than 1!\r\n"); 
    return 1;
  }
  
  else
  {
  return NumberOfElements;
  }
}

/**
* @brief  Sets the Attention Timer Callback function
* @param  none
* @retval MOBLE_RESULT status of result
*/ 
MOBLE_RESULT Appli_BleAttentionTimerCb(void)
{
/* avoid printf, if low power feature is supported */  
#if (LOW_POWER_FEATURE == 0)
  TRACE_M(TF_MISC, " \r\n");
#endif /* LOW_POWER_FEATURE == 0 */
  return MOBLE_RESULT_SUCCESS;
}


/**
* @brief  Call back function to give Output OOB information 
* @param  MOBLEUINT8* output_oob
* @param  MOBLEUINT8 size
* @retval void
*/ 
void Appli_BleOutputOOBAuthCb(MOBLEUINT8* output_oob, MOBLEUINT8 size)
{
#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
  uint32_t ooBData = 0;    
    for (MOBLEUINT8 i = 0; i < size; i++)
    {
        ooBData |= (output_oob[i] << 8*i);
    }
    OutputOobData = ooBData;
    TRACE_M(TF_PROVISION,"Output OOB information for provisioner: %ld\n\r", ooBData);
  #endif
}
  

#ifdef ENABLE_AUTH_TYPE_OUTPUT_OOB
/**
* @brief  Process for both output and Input OOB handling
* @param  void
* @retval void
*/ 
void Appli_OobAuthenticationProcess(void)
{
    if(OutputOobBlinkCount < OutputOobData)
    {
      OutputOobBlinkCount++;
      Appli_LedBlink();
    }
    else
    {
        OutputOobBlinkCount++;
        Clock_Wait(1000);
        if(OutputOobBlinkCount > OutputOobData+3)
        {
            OutputOobBlinkCount = 0;
        }
    }
}
#endif


/**
* @brief  Call back function to provide Input OOB information
* @param  MOBLEUINT8 size
* @retval MOBLEUINT8*  
*/ 
MOBLEUINT8* Appli_BleInputOOBAuthCb(MOBLEUINT8 size)
{
#if defined (ENABLE_AUTH_TYPE_INPUT_OOB) && (ENABLE_SERIAL_INTERFACE)
  MOBLEUINT16 inputTimer = 0; 
  TRACE_M(TF_PROVISION,"Input OOB information for provisioner-Size: %d\n\r", size);   
  while(1)
  {
      Serial_InterfaceProcess();
      /* Check if input is completed or timeout */
      if((inputOOBDataReady != 0x00) | (inputTimer > INPUT_OOB_TIMEOUT))
      {
          inputOOBDataReady = 0;
          break;
      }
      Clock_Wait(100);
      inputTimer++;
  }
  return InputOobData; 
#else
  return NULL;
#endif
}


/**
* @brief  Call back function to provide Input OOB information
* @param  rcvdStringBuff: buffer to store input string 
* @param  rcvdStringSize: length of the input string 
* @retval void  
*/ 
void Appli_BleSerialInputOOBValue(char *rcvdStringBuff, uint16_t rcvdStringSize)
{
#ifdef  ENABLE_AUTH_TYPE_INPUT_OOB
  unsigned long long InputOobDatatemp;
    sscanf(rcvdStringBuff + 5, "%lld", &InputOobDatatemp);
    memmove(&InputOobData, &InputOobDatatemp, sizeof(InputOobDatatemp));
    inputOOBDataReady = 1;
#endif
}


/**
* @brief  Application BLE Disable Filter 
* @param  none
* @retval Status is replied
*/
MOBLEUINT8 Appli_BleDisableFilterCb(void)
{
    return DisableFilter;
}

/**
* @brief  Checks and do Manual Unprovision of board  
* @param  void
* @retval void
*/ 
void Appli_CheckForUnprovision(void)
{
  /* Checks if the User button is pressed or not at the startup */
  if (BSP_PB_GetState(BUTTON_SW1) == BUTTON_PRESSED)
  {
    BSP_LED_On(LED_RED);
    tClockTime t = Clock_Time();
    int interrupted = 0;
    
